# data-analyst-interview
  
# Important Instructions
**Candidates shall use PowerBI and CSV Files/any database to implement the task.**  

# Candidate can choose to complete Task 1 or Task 2:
## Task 1
1. Use DDL & DML script files to create physical database model.
2. Process the raw data in zip folder and load the processed data model into a database for querying the results. 
3. Apply analytics.
4. Create a visual story behind the data using PowerBI.
5. Explain and provide a quick summary of the PowerBI Dashboard / Report.

## Task 2
1. Use the following CSV Files as data source:
   - paymenttype.csv
   - ratecode.csv
   - taxi_zone_lookup.csv
   - tripdata.zip [tripdata\tripdata.csv] 
2. Apply analytics.
3. Create a visual story behind the data using PowerBI.
4. Explain and provide a quick summary of the PowerBI Dashboard / Report.


# Candidate can choose to share his/her work via Method 1 or Method 2: <br>
## Method 1
1. Commit your works into github, share the repo with CDataTeam (by inviting the CDataTeam as a collaborator to your Github Repository).

## Method 2
1. Send your works via email.

### Submission Deadline: Refer to Email Communication.

In [1]:
# import functions

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from datetime import datetime

### Data inspection and data cleaning

To check for missing data if the data is of the correct types.

In [2]:
# import data
 
df1 = pd.read_csv("tripinfo-main\\Task2\\paymenttype.csv")
df2 = pd.read_csv("tripinfo-main\\Task2\\ratecode.csv")
df3 = pd.read_csv("tripinfo-main\\Task2\\taxi_zone_lookup.csv")
df4 = pd.read_csv("tripinfo-main\\Task2\\tripdata\\tripdata.csv")

In [3]:
print(df1.info())
df1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      6 non-null      int64
 1   name    6 non-null      object
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes
None

   id         name
0   1  Credit card
1   2         Cash
2   3    No charge
3   4      Dispute
4   5      Unknown
5   6  Voided trip

In [4]:
print(df2.info())
df2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      6 non-null      int64
 1   name    6 non-null      object
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes
None

   id                   name
0   1          Standard rate
1   2                    JFK
2   3                 Newark
3   4  Nassau or Westchester
4   5        Negotiated fare
5   6             Group ride

In [5]:
print(df3.info())
df3

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265 entries, 0 to 264
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   LocationID    265 non-null    int64
 1   Borough       265 non-null    object
 2   Zone          264 non-null    object
 3   service_zone  263 non-null    object
dtypes: int64(1), object(3)
memory usage: 8.4+ KB
None

     LocationID        Borough                     Zone service_zone
0             1            EWR           Newark Airport          EWR
1             2         Queens              Jamaica Bay    Boro Zone
2             3          Bronx  Allerton/Pelham Gardens    Boro Zone
3             4      Manhattan            Alphabet City  Yellow Zone
4             5  Staten Island            Arden Heights    Boro Zone
..          ...            ...                      ...          ...
260         261      Manhattan       World Trade Center  Yellow Zone
261         262      Manhattan           Yorkville East  Yellow Zone
262         263      Manhattan           Yorkville West  Yellow Zone
263         264        Unknown                       NV          NaN
264         265        Unknown                      NaN          NaN

[265 rows x 4 columns]

In [6]:
print(df4.info())
df4
df4.rename(columns = {'Unnamed: 0':'pid'}, inplace = True)
# LocationID // PULocationID, DOLocationID
# id, name //

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2044643 entries, 0 to 2044642
Data columns (total 18 columns):
 #   Column                 Dtype
---  ------                 -----
 0   Unnamed: 0             int64
 1   VendorID               int64
 2   tpep_pickup_datetime   object
 3   tpep_dropoff_datetime  object
 4   passenger_count        int64
 5   trip_distance          float64
 6   RatecodeID             int64
 7   store_and_fwd_flag     object
 8   PULocationID           int64
 9   DOLocationID           int64
 10  payment_type           int64
 11  fare_amount            float64
 12  extra                  float64
 13  mta_tax                float64
 14  tip_amount             float64
 15  tolls_amount           float64
 16  improvement_surcharge  float64
 17  total_amount           float64
dtypes: float64(8), int64(7), object(3)
memory usage: 280.8+ MB
None

In [7]:
df1.rename(columns = {'id':'payment_type', 'name': 'payment_type_label'}, inplace = True)
df2.rename(columns = {'id':'RatecodeID', 'name': 'RatecodeID_label'}, inplace = True)

df5 = pd.merge(df4, df1, how='left', on='payment_type')
df5 = pd.merge(df5, df2, how='left', on='RatecodeID')
df5 = pd.merge(df5, df3, how='left', left_on='PULocationID', right_on='LocationID')
df5 = pd.merge(df5, df3, how='left', left_on='DOLocationID', right_on='LocationID', suffixes=(None, '_DO'))

df5.rename(columns = {'LocationID':'LocationID_PU', 'Borough': 'Borough_PU', 'Zone': 'Zone_PU', 'service_zone':'service_zone_PU'}, inplace = True)

In [8]:
df5.columns

Index(['pid', 'VendorID', 'tpep_pickup_datetime', 'tpep_dropoff_datetime',
       'passenger_count', 'trip_distance', 'RatecodeID', 'store_and_fwd_flag',
       'PULocationID', 'DOLocationID', 'payment_type', 'fare_amount', 'extra',
       'mta_tax', 'tip_amount', 'tolls_amount', 'improvement_surcharge',
       'total_amount', 'payment_type_label', 'RatecodeID_label',
       'LocationID_PU', 'Borough_PU', 'Zone_PU', 'service_zone_PU',
       'LocationID_DO', 'Borough_DO', 'Zone_DO', 'service_zone_DO'],
      dtype='object')

In [9]:
df5['RatecodeID'].value_counts()

1     1986352
2       46758
5        6599
3        3826
4        1056
99         30
6          22
Name: RatecodeID, dtype: int64

In [10]:
df5['RatecodeID_label'].value_counts()

Standard rate            1986352
JFK                        46758
Negotiated fare             6599
Newark                      3826
Nassau or Westchester       1056
Group ride                    22
Name: RatecodeID_label, dtype: int64

In [11]:
df5.isnull().sum().sort_values(ascending=False)

service_zone_DO          39507
service_zone_PU          38156
Zone_DO                   4823
Zone_PU                    988
RatecodeID_label            30
VendorID                     0
Borough_DO                   0
LocationID_DO                0
Borough_PU                   0
LocationID_PU                0
payment_type_label           0
total_amount                 0
improvement_surcharge        0
tolls_amount                 0
pid                          0
mta_tax                      0
extra                        0
fare_amount                  0
payment_type                 0
DOLocationID                 0
PULocationID                 0
store_and_fwd_flag           0
RatecodeID                   0
trip_distance                0
passenger_count              0
tpep_dropoff_datetime        0
tpep_pickup_datetime         0
tip_amount                   0
dtype: int64

In [12]:
pd.crosstab(df5['RatecodeID_label'], df5['payment_type_label'], dropna=False)

payment_type_label       Cash  Credit card  Dispute  No charge
RatecodeID_label
Group ride                  9            2        1         10
JFK                     14242        31951      111        454
Nassau or Westchester     470          540       10         36
Negotiated fare          1250         4936       62        351
Newark                   1307         2343       28        148
Standard rate          734100      1240354     2665       9233

In [13]:
df5['RatecodeID_label'].value_counts(normalize=True)

Standard rate            0.971505
JFK                      0.022869
Negotiated fare          0.003228
Newark                   0.001871
Nassau or Westchester    0.000516
Group ride               0.000011
Name: RatecodeID_label, dtype: float64

In [14]:
display(df5['payment_type_label'].value_counts(normalize=True))
display(df5['payment_type_label'].value_counts())

Credit card    0.626100
Cash           0.367487
No charge      0.005005
Dispute        0.001407
Name: payment_type_label, dtype: float64

Credit card    1280152
Cash            751380
No charge        10234
Dispute           2877
Name: payment_type_label, dtype: int64

In [15]:
df5.head()

,pid,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,...,payment_type_label,RatecodeID_label,LocationID_PU,Borough_PU,Zone_PU,service_zone_PU,LocationID_DO,Borough_DO,Zone_DO,service_zone_DO
0,4,2,2017-01-01 00:00:00,2017-01-01 00:00:00,1,0.02,2,N,249,234,...,Cash,JFK,249,Manhattan,West Village,Yellow Zone,234,Manhattan,Union Sq,Yellow Zone
1,5,1,2017-01-01 00:00:02,2017-01-01 00:03:50,1,0.50,1,N,48,48,...,Cash,Standard rate,48,Manhattan,Clinton East,Yellow Zone,48,Manhattan,Clinton East,Yellow Zone
2,6,2,2017-01-01 00:00:02,2017-01-01 00:39:22,4,7.75,1,N,186,36,...,Credit card,Standard rate,186,Manhattan,Penn Station/Madison Sq West,Yellow Zone,36,Brooklyn,Bushwick North,Boro Zone
3,7,1,2017-01-01 00:00:03,2017-01-01 00:06:58,1,0.80,1,N,162,161,...,Credit card,Standard rate,162,Manhattan,Midtown East,Yellow Zone,161,Manhattan,Midtown Center,Yellow Zone
4,8,1,2017-01-01 00:00:05,2017-01-01 00:08:33,2,0.90,1,N,48,50,...,Credit card,Standard rate,48,Manhattan,Clinton East,Yellow Zone,50,Manhattan,Clinton West,Yellow Zone

## Data Inspection

In [16]:
# Date range for data

print(df5['tpep_pickup_datetime'].min(), df5['tpep_pickup_datetime'].max())

2017-01-01 00:00:00 2017-01-07 23:59:59

In [17]:
# create groups of variables

coi = ['tpep_pickup_datetime', 'tpep_dropoff_datetime', 'PULocationID', 'DOLocationID',
    'trip_distance', 'RatecodeID_label', 'payment_type_label', 'total_amount', 'duplicated']

pay = df5.columns[11:18]

In [18]:
df5.groupby('RatecodeID_label')[pay].agg(['mean', 'min', 'max'])

                      fare_amount                       extra               \
                             mean    min        max      mean   min    max
RatecodeID_label
Group ride               3.693636    0.0      32.76  0.000000   0.0   0.00
JFK                     51.870012  -52.0      52.00  0.653709  -4.5   5.50
Nassau or Westchester   65.044034    0.0     384.00  0.351799   0.0   1.00
Negotiated fare         56.674226 -300.0     450.00  0.000000   0.0   0.00
Newark                  64.246341  -21.5     171.50  0.191647  -0.5  55.54
Standard rate           11.256287  -13.5  538579.20  0.316056 -55.2   5.00

                        mta_tax            tip_amount  ...          \
                           mean  min   max       mean  ...     max
RatecodeID_label                                       ...
Group ride             0.454545  0.0   0.5   6.895455  ...  147.00
JFK                    0.498685 -0.5   0.5   6.887857  ...  123.00
Nassau or Westchester  0.499527  0.0   0.5   5.878371  ...   64.45
Negotiated fare        0.152220 -0.5   0.5   6.209117  ...  200.00
Newark                 0.000000  0.0   0.0   8.124660  ...  130.00
Standard rate          0.499462 -0.5  56.5   1.458887  ...  300.00

                      tolls_amount               improvement_surcharge       \
                              mean   min     max                  mean  min
RatecodeID_label
Group ride                0.000000  0.00    0.00              0.272727  0.0
JFK                       4.194710 -5.54  555.54              0.299249 -0.3
Nassau or Westchester     1.849062  0.00   30.00              0.299716  0.0
Negotiated fare           2.920068  0.00  105.54              0.289908 -0.3
Newark                   13.062896  0.00   44.08              0.298510 -0.3
Standard rate             0.146815 -5.54  560.42              0.299714 -0.3

                           total_amount
                       max         mean     min        max
RatecodeID_label
Group ride             0.3    11.316364    0.00     150.30
JFK                    0.3    64.406856  -58.34     608.34
Nassau or Westchester  0.3    73.935388    0.00     387.34
Negotiated fare        0.3    66.249107 -300.30     467.88
Newark                 0.3    85.933816  -21.80     234.34
Standard rate          0.3    13.981916  -14.30  538580.00

[6 rows x 21 columns]

In [19]:
df5.groupby('payment_type_label')[pay].agg(['min', 'max'])

                   fare_amount            extra        mta_tax        \
                           min       max    min    max     min   max
payment_type_label
Cash                     -10.0     450.0 -55.20   5.50    -0.5  56.5
Credit card                0.0     413.0  -0.45   4.54     0.0   0.5
Dispute                 -120.0     188.5  -4.50   4.50    -0.5   0.5
No charge               -300.0  538579.2  -4.50  55.54    -0.5   0.5

                   tip_amount         tolls_amount          \
                          min     max          min     max
payment_type_label
Cash                     0.00    1.36        -5.54  101.10
Credit card              0.00  300.00         0.00   90.00
Dispute                  0.00    0.00         0.00  555.54
No charge               -6.06    5.00        -5.54  560.42

                   improvement_surcharge      total_amount
                                     min  max          min        max
payment_type_label
Cash                                -0.3  0.3        -10.3     450.30
Credit card                          0.0  0.3          0.0     467.88
Dispute                             -0.3  0.3       -120.3     608.34
No charge                           -0.3  0.3       -300.3  538580.00

**Check Duplicates**

In [20]:
# Check duplicates

dup_mask = df5.duplicated(subset=['tpep_pickup_datetime', 'tpep_dropoff_datetime', 'PULocationID',
                                    'DOLocationID', 'trip_distance', 'passenger_count', 'VendorID'], keep=False)
df5['duplicated'] = dup_mask

In [21]:
print(df5.loc[df5['duplicated']==True, coi].shape)
df5.loc[df5['duplicated']==True, coi][:10]

(2014, 9)

,tpep_pickup_datetime,tpep_dropoff_datetime,PULocationID,DOLocationID,trip_distance,RatecodeID_label,payment_type_label,total_amount,duplicated
870,2017-01-01 07:02:33,2017-01-01 07:07:55,236,140,0.86,Standard rate,Cash,5.8,True
871,2017-01-01 07:02:33,2017-01-01 07:07:55,236,140,0.86,Standard rate,No charge,-5.8,True
1782,2017-01-01 07:15:54,2017-01-01 07:16:01,263,263,0.00,Standard rate,Cash,3.3,True
1783,2017-01-01 07:15:54,2017-01-01 07:16:01,263,263,0.00,Standard rate,No charge,-3.3,True
2643,2017-01-01 07:27:27,2017-01-01 07:31:10,48,186,0.76,Standard rate,Cash,5.8,True
2644,2017-01-01 07:27:27,2017-01-01 07:31:10,48,186,0.76,Standard rate,No charge,-5.8,True
3386,2017-01-01 07:38:35,2017-01-01 07:39:29,223,223,0.23,Standard rate,Cash,3.8,True
3387,2017-01-01 07:38:35,2017-01-01 07:39:29,223,223,0.23,Standard rate,No charge,-3.8,True
3412,2017-01-01 07:38:56,2017-01-01 07:47:23,237,237,0.12,Standard rate,Cash,7.3,True
3413,2017-01-01 07:38:56,2017-01-01 07:47:23,237,237,0.12,Standard rate,Dispute,-7.3,True

Duplicates appears to be fee reversals as the total_amount is negative of the prior.

In [22]:
df5.loc[df5['duplicated']==True, 'payment_type_label'].value_counts()

Cash           1011
No charge       638
Dispute         346
Credit card      19
Name: payment_type_label, dtype: int64

In [23]:
# Which ones DO NOT add up to 0?

temp = df5.loc[df5['duplicated']==True, coi].groupby('tpep_pickup_datetime')['total_amount']\
    .sum().sort_values(ascending=False)[:10]
temp_ind = temp.index[0]
temp

tpep_pickup_datetime
2017-01-05 21:11:45    111.1
2017-01-01 00:11:22      0.0
2017-01-06 01:46:40      0.0
2017-01-05 23:50:10      0.0
2017-01-05 23:57:41      0.0
2017-01-05 23:59:23      0.0
2017-01-06 00:00:54      0.0
2017-01-06 00:16:26      0.0
2017-01-06 00:18:43      0.0
2017-01-06 00:50:43      0.0
Name: total_amount, dtype: float64

In [24]:
df5.loc[(df5['tpep_pickup_datetime']==temp_ind) & df5['duplicated']==True, coi] # Probably separate trips

,tpep_pickup_datetime,tpep_dropoff_datetime,PULocationID,DOLocationID,trip_distance,RatecodeID_label,payment_type_label,total_amount,duplicated
390297,2017-01-05 21:11:45,2017-01-05 21:11:45,89,264,0.0,Standard rate,Cash,55.3,True
390298,2017-01-05 21:11:45,2017-01-05 21:11:45,89,264,0.0,Standard rate,Cash,55.8,True

In [25]:
# edit datapoint

df5.loc[(df5['tpep_pickup_datetime']==temp_ind) & df5['duplicated']==True, 'duplicated'] = False
df5.loc[(df5['tpep_pickup_datetime']==temp_ind), 'duplicated']

390297    False
390298    False
390299    False
390300    False
390301    False
390302    False
390303    False
Name: duplicated, dtype: bool

In [26]:
df5.loc[df5['total_amount']<=0,:].shape

(1121, 29)

**However, there are still many total_amount < 0 which do not have a duplicate**
Unable to determine what they might be.

In [27]:
# Assume these are reversals as well?

df5.loc[(df5['duplicated']==False) & (df5['total_amount']<0), coi]

,tpep_pickup_datetime,tpep_dropoff_datetime,PULocationID,DOLocationID,trip_distance,RatecodeID_label,payment_type_label,total_amount,duplicated
147639,2017-01-01 03:12:16,2017-01-01 03:15:10,186,230,0.48,Standard rate,Dispute,-4.8,False
174665,2017-01-01 05:00:21,2017-01-01 05:02:20,264,234,0.00,Negotiated fare,Dispute,-120.3,False
826768,2017-01-07 03:28:12,2017-01-07 03:34:40,141,263,0.81,Standard rate,Dispute,-5.8,False
1313467,2017-01-03 00:29:59,2017-01-03 00:31:49,151,151,0.13,Standard rate,No charge,-3.8,False
1601671,2017-01-04 04:45:24,2017-01-04 04:54:31,161,170,0.99,Standard rate,Dispute,-6.8,False
1762468,2017-01-04 17:06:23,2017-01-04 17:08:53,249,158,0.32,Standard rate,No charge,-4.8,False
1963762,2017-01-05 10:20:52,2017-01-05 10:40:21,161,234,0.36,JFK,No charge,-52.8,False

**Check RatecodeID_label NaN**

In [28]:
print(df5.loc[df5['RatecodeID'] == 99, :].shape) # 30 rows RatecodeID_label isnull
display(df5.loc[df5['RatecodeID_label'].isnull(), :][:10])
display(df5.loc[df5['RatecodeID_label'].isnull(), pay][:10])

(30, 29)

,pid,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,...,RatecodeID_label,LocationID_PU,Borough_PU,Zone_PU,service_zone_PU,LocationID_DO,Borough_DO,Zone_DO,service_zone_DO,duplicated
132991,132996,1,2017-01-01 02:29:13,2017-01-01 02:29:13,0,0.0,99,N,264,264,...,NaN,264,Unknown,NV,NaN,264,Unknown,NV,NaN,False
140175,140180,1,2017-01-01 02:49:31,2017-01-01 02:49:31,0,0.0,99,Y,238,264,...,NaN,238,Manhattan,Upper West Side North,Yellow Zone,264,Unknown,NV,NaN,False
155241,155246,1,2017-01-01 03:37:06,2017-01-01 03:37:06,0,0.0,99,N,264,264,...,NaN,264,Unknown,NV,NaN,264,Unknown,NV,NaN,False
196558,196563,1,2017-01-01 00:37:44,2017-01-01 00:37:44,0,0.0,99,Y,190,264,...,NaN,190,Brooklyn,Prospect Park,Boro Zone,264,Unknown,NV,NaN,False
323902,1451334,1,2017-01-05 17:59:10,2017-01-05 17:59:10,0,0.0,99,N,264,264,...,NaN,264,Unknown,NV,NaN,264,Unknown,NV,NaN,False
346285,1483200,1,2017-01-05 19:02:23,2017-01-05 19:02:23,0,0.0,99,N,264,264,...,NaN,264,Unknown,NV,NaN,264,Unknown,NV,NaN,False
357242,1494157,1,2017-01-05 19:33:01,2017-01-05 19:33:01,0,0.0,99,N,264,264,...,NaN,264,Unknown,NV,NaN,264,Unknown,NV,NaN,False
382136,1519051,1,2017-01-05 20:47:24,2017-01-05 20:47:24,0,0.0,99,N,264,264,...,NaN,264,Unknown,NV,NaN,264,Unknown,NV,NaN,False
416436,1562631,1,2017-01-05 22:26:46,2017-01-05 22:26:46,0,0.0,99,N,264,264,...,NaN,264,Unknown,NV,NaN,264,Unknown,NV,NaN,False
470580,1747263,1,2017-01-06 06:42:04,2017-01-06 06:42:04,1,0.0,99,N,107,264,...,NaN,107,Manhattan,Gramercy,Yellow Zone,264,Unknown,NV,NaN,False

,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
132991,34.30,0.0,0.0,0.0,0.0,0.0,34.30
140175,18.95,0.0,0.0,0.0,0.0,0.0,18.95
155241,7.30,0.0,0.0,0.0,0.0,0.0,7.30
196558,8.75,0.0,0.0,0.0,0.0,0.0,8.75
323902,63.00,0.0,0.0,0.0,0.0,0.0,63.00
346285,134.00,0.0,0.0,0.0,0.0,0.0,134.00
357242,42.20,0.0,0.5,10.0,0.0,0.3,53.00
382136,14.80,0.0,0.0,0.0,0.0,0.0,14.80
416436,24.35,0.0,0.0,0.0,0.0,0.0,24.35
470580,0.00,0.0,0.0,0.0,0.0,0.0,0.00

**Check passenger_count data**

In [29]:
# Check passenger_count data
print(df5.loc[df5['passenger_count']==0, :].shape)
df5.loc[df5['passenger_count']==0, coi][:20]

# When passenger_count == 0 it is a negotiated fare or NA

(94, 29)

,tpep_pickup_datetime,tpep_dropoff_datetime,PULocationID,DOLocationID,trip_distance,RatecodeID_label,payment_type_label,total_amount,duplicated
186,2017-01-01 06:53:26,2017-01-01 06:53:37,48,48,0.00,Negotiated fare,Credit card,7.56,False
39440,2017-01-01 12:30:42,2017-01-01 12:30:45,264,265,0.05,Negotiated fare,Credit card,60.80,False
79602,2017-01-01 15:39:58,2017-01-01 15:40:01,264,239,0.00,Negotiated fare,Credit card,13.80,False
127039,2017-01-01 02:12:57,2017-01-01 02:13:00,209,209,0.00,Negotiated fare,Cash,19.80,False
129393,2017-01-01 02:19:11,2017-01-01 02:19:24,234,234,0.02,Negotiated fare,Credit card,6.30,False
132991,2017-01-01 02:29:13,2017-01-01 02:29:13,264,264,0.00,NaN,Credit card,34.30,False
134677,2017-01-01 02:33:59,2017-01-01 02:35:08,79,79,0.00,Negotiated fare,Credit card,33.36,False
140175,2017-01-01 02:49:31,2017-01-01 02:49:31,238,264,0.00,NaN,Credit card,18.95,False
144386,2017-01-01 03:02:11,2017-01-01 03:02:15,234,234,0.00,Negotiated fare,Credit card,11.10,False
147944,2017-01-01 03:13:11,2017-01-01 03:14:03,107,107,0.00,Negotiated fare,Cash,6.80,False
148434,2017-01-01 03:14:41,2017-01-01 03:14:45,107,107,0.00,Negotiated fare,Credit card,8.76,False
155241,2017-01-01 03:37:06,2017-01-01 03:37:06,264,264,0.00,NaN,Credit card,7.30,False
166129,2017-01-01 04:16:26,2017-01-01 04:47:50,80,80,0.00,Negotiated fare,Credit card,33.96,False
196558,2017-01-01 00:37:44,2017-01-01 00:37:44,190,264,0.00,NaN,No charge,8.75,False
200790,2017-01-01 00:48:23,2017-01-01 00:48:27,229,229,0.00,Negotiated fare,Credit card,7.80,False
230286,2017-01-01 19:01:09,2017-01-01 19:01:31,89,89,11.70,Negotiated fare,Credit card,42.35,False
258237,2017-01-01 21:31:11,2017-01-01 21:31:19,85,85,0.00,Negotiated fare,Credit card,26.80,False
289518,2017-01-05 15:55:14,2017-01-05 15:55:19,79,79,0.00,Negotiated fare,Credit card,14.16,False
319039,2017-01-05 17:43:58,2017-01-05 17:44:02,233,233,0.00,Negotiated fare,Credit card,32.88,False
323902,2017-01-05 17:59:10,2017-01-05 17:59:10,264,264,0.00,NaN,Credit card,63.00,False

**Check trip_distance data**

In [30]:
print(df5.loc[df5['trip_distance']<=0, coi].shape)
tripd0 = df5.loc[(df5['trip_distance']==0), :]

(12402, 9)

In [31]:
tripd0.loc[(tripd0['PULocationID']!=tripd0['DOLocationID']) &
    np.logical_not(tripd0['PULocationID'].isin([264, 265])) &
    np.logical_not(tripd0['DOLocationID'].isin([264, 265])), coi]

# unable to determine why trip_distance = 0

,tpep_pickup_datetime,tpep_dropoff_datetime,PULocationID,DOLocationID,trip_distance,RatecodeID_label,payment_type_label,total_amount,duplicated
477,2017-01-01 06:57:02,2017-01-01 06:57:47,230,163,0.0,Standard rate,Cash,3.30,False
1616,2017-01-01 07:13:13,2017-01-01 07:14:26,48,100,0.0,Newark,No charge,20.80,False
2302,2017-01-01 07:23:09,2017-01-01 07:25:38,164,186,0.0,Negotiated fare,Credit card,20.31,False
2399,2017-01-01 07:24:27,2017-01-01 07:24:34,68,246,0.0,Standard rate,Cash,3.30,False
2491,2017-01-01 07:25:38,2017-01-01 07:27:05,143,142,0.0,Standard rate,Cash,3.80,False
...,...,...,...,...,...,...,...,...,...
2036945,2017-01-05 14:59:49,2017-01-05 15:14:02,68,113,0.0,Standard rate,Cash,10.30,False
2041880,2017-01-05 15:16:11,2017-01-05 15:17:08,90,234,0.0,Standard rate,No charge,3.30,False
2042754,2017-01-05 15:18:55,2017-01-05 15:19:19,186,234,0.0,Standard rate,Cash,3.30,False
2043592,2017-01-05 15:21:42,2017-01-05 15:59:56,79,152,0.0,Standard rate,Credit card,26.76,False
2043762,2017-01-05 15:22:13,2017-01-05 16:12:16,237,41,0.0,JFK,Cash,52.80,False